src/InformationRegisters/ОчередьПолученияКвитанцийМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьПолученияКвитанцийМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбновитьСостояниеПодтверждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторВыбытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистраторыМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МДЛППрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СписокВходящихДокументовМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СписокВходящихДокументовМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОрганизацииОтправителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Загружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаНеТребуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СписокИсходящихДокументовМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СписокИсходящихДокументовМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Загружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаНеТребуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыАутентификацииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыАутентификацииМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пароль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ОрганизацииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОрганизацииМДЛП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерУчастника</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственнаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСхемОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекретКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАутентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыАутентификацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/МестаДеятельностиМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МестаДеятельностиМДЛП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМестаДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМестДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетВЭтойИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ТранспортМДЛПАПИВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает транспортные модули по отбору.
//
// Параметры:
//  Отбор - Структура - отбор.
// 
// Возвращаемое значение:
//  Массив - транспортные модули.
//
Функция ДоступныеТранспортныеМодули(Отбор = Неопределено) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОрганизацииМДЛП.Ссылка                         КАК Организация,
	|	ОрганизацииМДЛП.ИдентификаторКлиента           КАК ИдентификаторКлиента,
	|	ОрганизацииМДЛП.СекретКлиента                  КАК СекретКлиента,
	|	ОрганизацииМДЛП.РегистрационныйНомерУчастника  КАК ИдентификаторОрганизации,
	|	ОрганизацииМДЛП.ДатаНачалаИспользования        КАК ДатаНачалаИспользования,
	|	ОрганизацииМДЛП.ТипАутентификации              КАК ТипАутентификации,
	|	МестаДеятельностиМДЛП.Ссылка                   КАК МестоДеятельности,
	|	МестаДеятельностиМДЛП.Идентификатор            КАК ИдентификаторСубъектаОбращения
	|ИЗ
	|	Справочник.ОрганизацииМДЛП КАК ОрганизацииМДЛП
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.МестаДеятельностиМДЛП КАК МестаДеятельностиМДЛП
	|	ПО
	|		МестаДеятельностиМДЛП.Организация = ОрганизацииМДЛП.Ссылка
	|ГДЕ
	|	ОрганизацииМДЛП.СобственнаяОрганизация
	|	И НЕ ОрганизацииМДЛП.ПометкаУдаления
	|	И ЕСТЬNULL(МестаДеятельностиМДЛП.ВестиУчетВЭтойИБ, ЛОЖЬ)
	|";
	
	Запрос = Новый Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ОператорВыбрать = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	
	Индекс = 0;
	Если Отбор <> Неопределено Тогда
		Для Каждого Элемент Из Отбор Цикл
			
			Если ВРег(Элемент.Поле) = ВРег("Организация") Тогда
				ОператорВыбрать.Отбор.Добавить("ОрганизацииМДЛП.Ссылка = &Параметр_" + Индекс);
			ИначеЕсли ВРег(Элемент.Поле) = ВРег("МестоДеятельности") Тогда
				ОператорВыбрать.Отбор.Добавить("МестаДеятельностиМДЛП.Ссылка = &Параметр_" + Индекс);
			Иначе
				ВызватьИсключение НСтр("ru = 'Неподдерживаемый параметр отбора транспортных модулей МДЛП'");
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Параметр_" + Индекс, Элемент.Значение);
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ДоступныйТранспорт = Новый Массив;
	ПараметрыПодключенияПоИдентификаторам = Новый Соответствие;
	ПараметрыСервера = ПараметрыСервераАПИ();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПараметрыПодключения = ПараметрыПодключенияПоИдентификаторам.Получить(Выборка.ИдентификаторОрганизации);
		Если ПараметрыПодключения = Неопределено Тогда
			
			ПараметрыПодключения = Новый Структура;
			ПараметрыПодключения.Вставить("Организация");
			ПараметрыПодключения.Вставить("ИдентификаторОрганизации");
			ПараметрыПодключения.Вставить("ИдентификаторКлиента");
			ПараметрыПодключения.Вставить("СекретКлиента");
			ПараметрыПодключения.Вставить("ДатаНачалаИспользования");
			ПараметрыПодключения.Вставить("ТипАутентификации");
			
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыПодключения, ПараметрыСервера, Истина);
			
			ЗаполнитьЗначенияСвойств(ПараметрыПодключения, Выборка);
			ПараметрыПодключения.Вставить("ПрефиксВерсии", "/api/v1/");
			Если Не ЗначениеЗаполнено(ПараметрыПодключения.ТипАутентификации) Тогда
				ПараметрыПодключения.Вставить("ТипАутентификации", Перечисления.ТипыАутентификацииМДЛП.ЭП);
			КонецЕсли;
			
			ПараметрыПодключенияПоИдентификаторам.Вставить(Выборка.ИдентификаторОрганизации, ПараметрыПодключения);
			
			ДанныеМодуля = Новый Структура;
			ДанныеМодуля.Вставить("ИдентификаторСубъектаОбращения", Выборка.ИдентификаторОрганизации);
			ДанныеМодуля.Вставить("ЗагружатьВходящиеДокументы", Истина);
			ДанныеМодуля.Вставить("ОбменНаСервере", Ложь);
			ДанныеМодуля.Вставить("МенеджерОбменаНаКлиенте", Метаданные.ОбщиеМодули.ТранспортМДЛПАПИКлиент.Имя);
			ДанныеМодуля.Вставить("Представление", ?(ЗначениеЗаполнено(Выборка.Организация), Строка(Выборка.Организация), Выборка.ИдентификаторОрганизации));
			ДанныеМодуля.Вставить("ПараметрыПодключения", ПараметрыПодключения);
			ДоступныйТранспорт.Добавить(ДанныеМодуля);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ИдентификаторСубъектаОбращения) Тогда
			ДанныеМодуля = Новый Структура;
			ДанныеМодуля.Вставить("ИдентификаторСубъектаОбращения", Выборка.ИдентификаторСубъектаОбращения);
			ДанныеМодуля.Вставить("ЗагружатьВходящиеДокументы", Ложь);
			ДанныеМодуля.Вставить("ОбменНаСервере", Ложь);
			ДанныеМодуля.Вставить("МенеджерОбменаНаКлиенте", Метаданные.ОбщиеМодули.ТранспортМДЛПАПИКлиент.Имя);
			
			Представление = Новый Массив;
			Если ЗначениеЗаполнено(Выборка.Организация) Тогда
				Представление.Добавить(Строка(Выборка.Организация));
				Если ЗначениеЗаполнено(Выборка.МестоДеятельности) Тогда
					Представление.Добавить(Строка(Выборка.МестоДеятельности));
				КонецЕсли;
			Иначе
				Представление.Добавить(Строка(Выборка.ИдентификаторСубъектаОбращения));
			КонецЕсли;
			
			ДанныеМодуля.Вставить("Представление", СтрСоединить(Представление, " - "));
			
			ДанныеМодуля.Вставить("ПараметрыПодключения", ПараметрыПодключения);
			ДоступныйТранспорт.Добавить(ДанныеМодуля);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДоступныйТранспорт;
	
КонецФункции

Функция ПараметрыСервераАПИ() Экспорт
	
	Адрес = Константы.АдресСервисаМДЛП.Получить();
	Возврат ТранспортМДЛПКлиентСервер.ПолучитьПараметрыСервера(Адрес);
	
КонецФункции

Функция ВыполнитьМетодАПИ(Знач ТранспортныйМодуль, Знач ИмяМетода, Знач Параметры = Неопределено) Экспорт
	
	Если ТипЗнч(Параметры) <> Тип("Массив") И ТипЗнч(Параметры) <> Тип("ФиксированныйМассив") Тогда
		Параметры = Новый Массив;
	КонецЕсли;
	
	СписокПараметров = "";
	Для Индекс = 0 По Параметры.ВГраница() Цикл
		СписокПараметров = СписокПараметров + ", Параметры[" + Формат(Индекс, "ЧН=0; ЧГ=") + "]";
	КонецЦикла;
	
	Выражение = СтрШаблон("ТранспортМДЛПАПИКлиентСервер.%1(ТранспортныйМодуль%2)", ИмяМетода, СписокПараметров);
	
	Возврат Вычислить(Выражение);
	
КонецФункции

Функция ПараметрыПодключения(Организация, МестоДеятельности) Экспорт
	
	Отбор = Новый Массив;
	Отбор.Добавить(Новый Структура("Поле, Значение", "Организация", Организация));
	Отбор.Добавить(Новый Структура("Поле, Значение", "МестоДеятельности", МестоДеятельности));
	
	ДоступныйТранспорт = ДоступныеТранспортныеМодули(Отбор);
	Если ДоступныйТранспорт.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДоступныйТранспорт[0].ПараметрыПодключения;
	
КонецФункции

Процедура ДобавитьСообщениеВОчередьПолученияКвитанций(Знач Сообщение, Знач ИдентификаторОрганизации, Знач ОбновитьСостояниеПодтверждения) Экспорт
	
	РегистрыСведений.ОчередьПолученияКвитанцийМДЛП.ДобавитьСообщениеВОчередь(Сообщение, ИдентификаторОрганизации, ОбновитьСостояниеПодтверждения);
	
КонецПроцедуры

Функция ПолучитьДанныеСообщенийОжидающихКвитанции(Знач ИдентификаторОрганизации) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Очередь.Сообщение                                 КАК Ссылка,
	|	Очередь.Сообщение.Операция                        КАК Операция,
	|	Очередь.Сообщение.ИдентификаторЗапроса            КАК ИдентификаторЗапроса,
	|	Очередь.Сообщение.ИдентификаторСубъектаОбращения  КАК ИдентификаторСубъектаОбращения
	|ИЗ
	|	РегистрСведений.ОчередьПолученияКвитанцийМДЛП КАК Очередь
	|ГДЕ
	|	Очередь.ИдентификаторОрганизации = &ИдентификаторОрганизации
	|	И Очередь.РегистраторВыбытия = ЗНАЧЕНИЕ(Справочник.РегистраторыМДЛП.ПустаяСсылка)
	|");
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ИдентификаторОрганизации);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

Процедура ЗарегистрироватьКвитанцииСообщения(Знач Сообщение, Знач Квитанции) Экспорт
	
	Для Каждого Квитанция Из Квитанции Цикл
		
		Если ТипЗнч(Квитанция.ТипДокумента) = Тип("Число") Тогда
			ТекстСообщения = Квитанция.ТекстСообщения;
		Иначе
			ТекстСообщения = ИнтеграцияМДЛП.СформироватьУведомлениеОбОшибкеФиксации(Квитанция.ТекстСообщения, Сообщение.ИдентификаторЗапроса, Квитанция.ТипДокумента);
		КонецЕсли;
		
		РезультатОперации = ИнтеграцияМДЛПВызовСервера.ЗарегистрироватьВходящееСообщениеКОбработке(
			ТекстСообщения, Сообщение.ИдентификаторЗапроса, Сообщение.ИдентификаторСубъектаОбращения);
		Если РезультатОперации.Статус = "Ошибка" Тогда
			ВызватьИсключение РезультатОперации.ОписаниеОшибки;
		КонецЕсли;
		
	КонецЦикла;
	
	РегистрыСведений.ОчередьПолученияКвитанцийМДЛП.УдалитьСообщениеИзОчереди(Сообщение.Ссылка);
	
КонецПроцедуры

Функция ПолучитьДатуПоследнегоДокументаСписка(Знач ТипСписка, Знач ИдентификаторОрганизации) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(СписокДокументов.ДатаДокумента), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокумента
	|ИЗ
	|	#СписокДокументов КАК СписокДокументов
	|ГДЕ
	|	СписокДокументов.ИдентификаторОрганизации = &ИдентификаторОрганизации
	|");
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ИдентификаторОрганизации);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СписокДокументов", МетаданныеСпискаПоТипу(ТипСписка).ПолноеИмя());
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ДатаДокумента;
	
КонецФункции

Процедура ДополнитьСписокДокументов(Знач ТипСписка, Знач ПолученныеДанные) Экспорт
	
	Если ПолученныеДанные.Количество() <> 0 Тогда
		
		ДанныеДокументов = Новый ТаблицаЗначений;
		ДанныеДокументов.Колонки.Добавить("ИдентификаторЗапроса"               , ОбщегоНазначения.ОписаниеТипаСтрока(36));
		ДанныеДокументов.Колонки.Добавить("ИдентификаторДокумента"             , ОбщегоНазначения.ОписаниеТипаСтрока(36));
		ДанныеДокументов.Колонки.Добавить("ДатаДокумента"                      , ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
		ДанныеДокументов.Колонки.Добавить("ИдентификаторОрганизацииОтправителя", Метаданные.ОпределяемыеТипы.ИдентификаторСубъектаОбращенияОбщийМДЛП.Тип);
		ДанныеДокументов.Колонки.Добавить("Отправитель"                        , Метаданные.ОпределяемыеТипы.ИдентификаторСубъектаОбращенияМДЛП.Тип);
		ДанныеДокументов.Колонки.Добавить("ИдентификаторОрганизации"           , Метаданные.ОпределяемыеТипы.ИдентификаторСубъектаОбращенияОбщийМДЛП.Тип);
		ДанныеДокументов.Колонки.Добавить("Получатель"                         , Метаданные.ОпределяемыеТипы.ИдентификаторСубъектаОбращенияМДЛП.Тип);
		ДанныеДокументов.Колонки.Добавить("ТипДокумента"                       , ОбщегоНазначения.ОписаниеТипаЧисло(10));
		
		Для Каждого ОписаниеДокумента Из ПолученныеДанные Цикл
			Если ОписаниеДокумента["doc_status"] = "PROCESSED_DOCUMENT" Или ОписаниеДокумента["doc_status"] = "FAILED_RESULT_READY" Тогда
				Описание = ДанныеДокументов.Добавить();
				Описание.ИдентификаторОрганизации            = ОписаниеДокумента["sys_id"];
				Описание.ИдентификаторДокумента              = ОписаниеДокумента["document_id"];
				Описание.ИдентификаторЗапроса                = ОписаниеДокумента["request_id"];
				Описание.ДатаДокумента                       = ТранспортМДЛПАПИКлиентСервер.СтрокаВДату(ОписаниеДокумента["date"]);
				Описание.ИдентификаторОрганизацииОтправителя = ОписаниеДокумента["sender_sys_id"];
				Описание.Отправитель                         = ОписаниеДокумента["sender"];
				Описание.Получатель                          = ОписаниеДокумента["receiver"];
				Описание.ТипДокумента                        = ОписаниеДокумента["doc_type"];
			КонецЕсли;
		КонецЦикла;
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ДанныеДокументов
		|ИЗ
		|	&Таблица КАК Таблица
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторДокумента
		|;
		|
		|//////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(МестаДеятельности.ВестиУчетВЭтойИБ, ЛОЖЬ)
		|			ТОГДА ЛОЖЬ
		|		КОГДА Таблица.ТипДокумента В (&ТипыДокументовПеремещения)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ               КАК ЗагрузкаНеТребуется,
		|	Таблица.*
		|ИЗ
		|	ДанныеДокументов КАК Таблица
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		#СписокДокументов КАК ИзвестныеДокументы
		|	ПО
		|		ИзвестныеДокументы.ИдентификаторДокумента = Таблица.ИдентификаторДокумента
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.МестаДеятельностиМДЛП КАК МестаДеятельности
		|	ПО
		|		МестаДеятельности.Идентификатор = Таблица." + ?(ВРег(ТипСписка) = "ВХОДЯЩИЕ", "Получатель", "Отправитель") + "
		|ГДЕ
		|	ИзвестныеДокументы.ИдентификаторДокумента ЕСТЬ NULL
		|УПОРЯДОЧИТЬ ПО
		|	Таблица.ДатаДокумента
		|";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#СписокДокументов", МетаданныеСпискаПоТипу(ТипСписка).ПолноеИмя());
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Таблица", ДанныеДокументов);
		ТипыДокументовПеремещения = Новый Массив;
		ТипыДокументовПеремещения.Добавить(431);
		ТипыДокументовПеремещения.Добавить(470);
		Запрос.УстановитьПараметр("ТипыДокументовПеремещения", ТипыДокументовПеремещения);
		
		МенеджерСписка = МенеджерСпискаПоТипу(ТипСписка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерСписка.ДобавитьОписаниеДокумента(Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОчередьЗагрузкиДокументов(Знач ТипСписка, Знач ИдентификаторОрганизации) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СписокДокументов.ДатаДокумента             КАК ДатаДокумента,
	|	СписокДокументов.ИдентификаторДокумента    КАК ИдентификаторДокумента,
	|	СписокДокументов.ИдентификаторЗапроса      КАК ИдентификаторЗапроса,
	|	СписокДокументов.ИдентификаторОрганизации  КАК ИдентификаторОрганизации
	|ИЗ
	|	#СписокДокументов КАК СписокДокументов
	|ГДЕ
	|	СписокДокументов.ИдентификаторОрганизации = &ИдентификаторОрганизации
	|	И НЕ СписокДокументов.Загружен
	|	И НЕ СписокДокументов.ЗагрузкаНеТребуется
	|УПОРЯДОЧИТЬ ПО
	|	СписокДокументов.ДатаДокумента
	|";
	
	МетаданныеСписка = МетаданныеСпискаПоТипу(ТипСписка);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#СписокДокументов", МетаданныеСписка.ПолноеИмя());
	
	ИгнорируемыеРеквизиты = Новый Массив;
	ИгнорируемыеРеквизиты.Добавить("ИдентификаторОрганизации");
	ИгнорируемыеРеквизиты.Добавить("ИдентификаторДокумента");
	ИгнорируемыеРеквизиты.Добавить("ИдентификаторЗапроса");
	ИгнорируемыеРеквизиты.Добавить("ДатаДокумента");
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ВыбираемыеПоля = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля;
	Для Каждого Ресурс Из МетаданныеСписка.Ресурсы Цикл
		Если ИгнорируемыеРеквизиты.Найти(Ресурс.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВыбираемыеПоля.Добавить(Ресурс.Имя);
	КонецЦикла;
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ИдентификаторОрганизации);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

Процедура ЗарегистрироватьВходящееСообщениеКОбработке(Знач ТипСписка, Знач ДокументИзОчереди, Знач ТекстСообщения, Знач ДополнительныеПараметры) Экспорт
	
	ИдентификаторСубъектаОбращения = Неопределено;
	Если ВРег(ТипСписка) = "ВХОДЯЩИЕ" Тогда
		ИдентификаторСубъектаОбращения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДокументИзОчереди, "Получатель");
	ИначеЕсли ДокументИзОчереди.ТипДокумента <> 431 Тогда // Если не перемещение
		ИдентификаторСубъектаОбращения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДокументИзОчереди, "Отправитель");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИдентификаторСубъектаОбращения) Тогда
		ИдентификаторСубъектаОбращения = ДокументИзОчереди.ИдентификаторОрганизации;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Результат = ИнтеграцияМДЛПВызовСервера.ЗарегистрироватьВходящееСообщениеКОбработке(
			ТекстСообщения,
			ДокументИзОчереди.ИдентификаторЗапроса,
			ИдентификаторСубъектаОбращения,
			ДополнительныеПараметры);
		Если Результат.Статус = "Ошибка" Тогда
			ВызватьИсключение Результат.ОписаниеОшибки;
		КонецЕсли;
		
		МенеджерСпискаПоТипу(ТипСписка).ОтметитьДокументЗагружен(ДокументИзОчереди.ИдентификаторДокумента);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция УстановитьБлокировку(Знач ТипСписка, Знач ИдентификаторОрганизации) Экспорт
	
	Менеджер = МенеджерСпискаПоТипу(ТипСписка);
	
	КлючБлокировки = Менеджер.СоздатьКлючЗаписи(Новый Структура("ИдентификаторДокумента", ИдентификаторОрганизации));
	ИдентификаторБлокировки = Новый УникальныйИдентификатор;
	ЗаблокироватьДанныеДляРедактирования(КлючБлокировки,, ИдентификаторБлокировки);
	
	ПараметрыБлокировки = Новый Структура;
	ПараметрыБлокировки.Вставить("КлючБлокировки", КлючБлокировки);
	ПараметрыБлокировки.Вставить("ИдентификаторБлокировки", ИдентификаторБлокировки);
	Возврат ПараметрыБлокировки;
	
КонецФункции

Процедура СнятьБлокировку(Знач ПараметрыБлокировки) Экспорт
	
	РазблокироватьДанныеДляРедактирования(ПараметрыБлокировки.КлючБлокировки, ПараметрыБлокировки.ИдентификаторБлокировки);
	
КонецПроцедуры

Функция МенеджерСпискаПоТипу(ТипСписка)
	
	Если ВРег(ТипСписка) = "ВХОДЯЩИЕ" Тогда
		Возврат РегистрыСведений.СписокВходящихДокументовМДЛП;
	КонецЕсли;
	
	Если ВРег(ТипСписка) = "ИСХОДЯЩИЕ" Тогда
		Возврат РегистрыСведений.СписокИсходящихДокументовМДЛП;
	КонецЕсли;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Некорректный тип списка: %1'"), ТипСписка);
	
КонецФункции

Функция МетаданныеСпискаПоТипу(ТипСписка)
	
	Если ВРег(ТипСписка) = "ВХОДЯЩИЕ" Тогда
		Возврат Метаданные.РегистрыСведений.СписокВходящихДокументовМДЛП;
	КонецЕсли;
	
	Если ВРег(ТипСписка) = "ИСХОДЯЩИЕ" Тогда
		Возврат Метаданные.РегистрыСведений.СписокИсходящихДокументовМДЛП;
	КонецЕсли;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Некорректный тип списка: %1'"), ТипСписка);
	
КонецФункции

#КонецОбласти
